InformationRegisters/РазделыДатЗапретаИзмененияОбъектовБЗК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РазделыДатЗапретаИзмененияОбъектовБЗК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Применение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предопределенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РазделСсылка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолеДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РазделыДатЗапретаИзмененияОбъектовБЗК/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Количество() > 0 Тогда
		
		ТаблицыОбъектов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
			ВыгрузитьКолонку("ОбъектМетаданных"), "ПолноеИмя");
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			Если Запись.Применение Тогда
				
				Если Не ЗначениеЗаполнено(Запись.ОбъектМетаданных) Тогда
					ТекстСообщения = НСтр("ru = 'Поле ""Таблица"" не заполнено'");
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения, КлючЗаписи(Запись), "Таблица", , Отказ);
					Продолжить;
				КонецЕсли;
				
				Таблица = ТаблицыОбъектов.Получить(Запись.ОбъектМетаданных);
				Если Метаданные.НайтиПоПолномуИмени(Таблица) = Неопределено Тогда
					ТекстСообщения = СтрШаблон(
						НСтр("ru = 'В составе метаданных отсутствует %1'"),
						Таблица);
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения, КлючЗаписи(Запись), "Таблица", , Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючЗаписи(Запись)
	
	СтруктураЗаписи = Новый Структура(
		"РазделСсылка,ОбъектМетаданных,ПолеДаты,ПолеОбъекта");
	ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
	
	Возврат РегистрыСведений.РазделыДатЗапретаИзмененияОбъектовБЗК.СоздатьКлючЗаписи(СтруктураЗаписи);
	
КонецФункции

#КонецОбласти


#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
